vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G430_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.37" 
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.37/schema/PACK.xsd">
    <vendor>NSING</vendor>
    <url>https://www.nsing.com.sg/public/uploads/armpacks/</url>
    <name>N32G430_DFP</name>
    <description>Nsing N32G430 Series Device Support, Drivers and Examples</description>

    <releases>
		<release date="2024-08-14" version="1.1.1">		    
            First release of N32G430_DFP
        </release>
    </releases>

    <keywords>
        <keyword>NSING</keyword>
        <keyword>Device Support</keyword>
        <keyword>N32G430</keyword>
    </keywords>

    <devices>
        <family Dfamily="N32G430 Series" Dvendor="NSING:185">
          <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="0" Dendian="Little-endian"/>
          <description>
The N32G430 series utilizes a 32-bit ARM Cortex-M4F core with operating frequency up to 128MHz, supporting floating-point unit and DSP instructions. 

- Up to 64KB embedded encrypted Flash memory.
- 16KB SRAM.
- A 12bit 4.7Msps ADC and 3 high-speed comparators
- Support for protocols such as U(S)ART, I2C, SPI and CAN	
- Operation of CRC16/CRC32 functionality.
          </description>
  
        <subFamily DsubFamily="N32G430">
		   <processor Dclock="128000000"/>		   
           <compile header="Device/Include/n32g430.h" define="N32G430 USE_STDPERIPH_DRIVER"/>
	  	   <feature type="XTAL"     n="14000000"    m="32000000"/>		   
	  	   <feature type="VCC"      n="1.80"        m="3.60"/>		   
		   <feature type="Timer"    n="7"           m="16" name="7x 16-bit timer" />	
	  	   <feature type="RTC"      n="32768"       name="32.768 kHz External clock"/>				   
		   <feature type="WDT"      n="2"/>
		   <feature type="I2C"      n="2"/>
		   <feature type="USART"    n="2"/>
		   <feature type="SPI"      n="2"/>		
		   <feature type="Temp"          n="-40"     m="105"/>
		   <feature type="DMA"           n="8"/>	
		  <!-- *************************  Device 'N32G430C8L7'  ***************************** -->
		  <device Dname="N32G430C8L7">
			<description>
- Package:  LQFP48 
- PWM:   38
			</description>
			<feature type="QFP"   count="48" name="LQFP48"/>
		    <feature type="Memory" n="64"    name="Flash"/>			
			<feature type="IOs"   n="40"     name="Input and Output Ports"/>
			<feature type="UART"  n="2"/>				
			<feature type="ADC"   n="16"     m="12"  name="16-ch 12-bit ADC"/>	
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
          </device>	

		 <!-- *************************  Device 'N32G430C8Q7'  ***************************** -->
	     <device Dname="N32G430C8Q7">
			<description>
- Package:  QFP48 
- PWM:   38
			</description>
			<feature type="QFP"   count="48" name="QFP48"/>
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="40"     name="Input and Output Ports"/>
			<feature type="ADC"   n="16"     m="12"  name="16-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430K8L7'  ***************************** -->
		  <device Dname="N32G430K8L7">
			<description>
- Package:  LQFP32 
- PWM:   34
			</description>
			<feature type="QFP"   count="32" name="LQFP32" />
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="27"     name="Input and Output Ports"/>
			<feature type="ADC"   n="10"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
			</device>

		  <!-- *************************  Device 'N32G430K8Q7'  ***************************** -->
		  <device Dname="N32G430K8Q7">
			<description>
- Package:  QFP32 
- PWM:   22
			</description>
			<feature type="QFP"   count="32" name="QFP32"/>
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="26"     name="Input and Output Ports"/>
			<feature type="ADC"   n="10"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430G8Q7'  ***************************** -->
		  <device Dname="N32G430G8Q7">
			<description>
- Package:  QFP28 
- PWM:   33
			</description>
			<feature type="QFP"   count="28" name="QFP28"/>
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="24"     name="Input and Output Ports"/>
			<feature type="ADC"   n="10"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430F8Q7'  ***************************** -->
		  <device Dname="N32G430F8Q7">
			<description>
- Package:  QFP20 
- PWM:   21
			</description>
			<feature type="QFP"   count="20" name="QFP28" />
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="16"     name="Input and Output Ports"/>
			<feature type="ADC"   n="7"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="1"/>	
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430F8S7'  ***************************** -->
		  <device Dname="N32G430F8S7">
			<description>
- Package:  TSSOP20 
- PWM:   21
			</description>
			<!-- feature type="TSSOP"   count="20" name="TSSOP20"/ -->
		    <feature type="Memory" n="64"    name="Flash"/>				
			<feature type="IOs"   n="16"     name="Input and Output Ports"/>
			<feature type="ADC"   n="9"     m="12"  name="9-ch 12-bit ADC"/>	
			<feature type="UART"  n="1"/>			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x10000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x10000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

