vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G430_DFP.pdsc
		  <!-- *************************  Device 'N32G430C6L7'  ***************************** -->
		  <device Dname="N32G430C6L7">
			<description>
- Package:  LQFP48 
- PWM:   38
			</description>
			<feature type="QFP"  count="48" name="LQFP48" />
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="40"     name="Input and Output Ports"/>
			<feature type="ADC"   n="16"     m="12"  name="16-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>			
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>	

	      <!-- *************************  Device 'N32G430C6Q7'  ***************************** -->
		  <device Dname="N32G430C6Q7">
			<description>
- Package:  QFN48 
- PWM:   38
			</description>
			<feature type="QFP"  count="48" name="LQFP48"/>
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="40"     name="Input and Output Ports"/>
			<feature type="ADC"   n="16"     m="12"  name="16-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430K6L7'  ***************************** -->
		  <device Dname="N32G430K6L7">
			<description>
- Package:  LQFP32 
- PWM:   34
			</description>
			<feature type="QFP"  count="32" name="LQFP32"/>
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="26"     name="Input and Output Ports"/>
			<feature type="ADC"   n="16"     m="12"  name="16-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430K6Q7'  ***************************** -->
		  <device Dname="N32G430K6Q7">
			<description>
- Package:  QFN32 
- PWM:   34
			</description>
			<feature type="QFP"  count="32" name="QFP32"/>
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="26"     name="Input and Output Ports"/>
			<feature type="ADC"   n="10"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430G6Q7'  ***************************** -->
		  <device Dname="N32G430G6Q7">
			<description>
- Package:  QFN28 
- PWM:   33
			</description>
			<feature type="QFN"  count="28" name="QFN32"/>
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="24"     name="Input and Output Ports"/>
			<feature type="ADC"   n="10"     m="12"  name="10-ch 12-bit ADC"/>	
			<feature type="UART"  n="2"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430F6Q7'  ***************************** -->
		  <device Dname="N32G430F6Q7">
			<description>
- Package:  QFN20 
- PWM:   21
			</description>
			<feature type="QFN"  count="20" name="QFN20"/>
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="16"     name="Input and Output Ports"/>
			<feature type="ADC"   n="7"     m="12"  name="7-ch 12-bit ADC"/>	
			<feature type="UART"  n="1"/>				
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>

		  <!-- *************************  Device 'N32G430F6S7'  ***************************** -->
		  <device Dname="N32G430F6S7">
			<description>
- Package:  TSSOP20 
- PWM:   21
			</description>
			<!-- feature type="TSSOP"  count="20" name="TSSOP20"/ -->
		    <feature type="Memory" n="32"    name="Flash"/>				
			<feature type="IOs"   n="16"     name="Input and Output Ports"/>
			<feature type="ADC"   n="9"     m="12"  name="9-ch 12-bit ADC"/>	
			<feature type="UART"  n="1"/>	
			<memory id="IRAM1"   start="0x20000000" size="0x4000" default="1" init="0"/>
			<memory id="IROM1"   start="0x08000000" size="0x8000" default="1" startup="1"/>
			<algorithm name="Flash/N32G430.FLM" start="0x08000000" size="0x8000" default="1"/>
			<debug svd="svd/N32G430.svd"/>
		  </device>
        </subFamily>
        </family>
    </devices>        

    <conditions>
		<!-- Compiler Conditions -->
        <condition id="Compiler ARMCC">             
            <require Tcompiler="ARMCC"/>
        </condition>
        
		<!-- Device Conditions -->
		<condition id="N32G430">
		  <description>NSING N32G430 Devices</description> 
		  <require Dvendor="NSING:185" Dname="N32*"/>
		</condition>
		
		<!-- Device + CMSIS Conditions -->
        <condition id="N32G430 CMSIS">            
            <description>NSING N32G430 Devices</description>
			<accept condition="N32G430"/>
			<require Cclass="CMSIS" Cgroup="CORE"/>
        </condition>
		
