vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G430_DFP.pdsc
		<!-- N32G430 STDPERIPHERALS RCC Conditions -->
        <condition id="N32G430 STDPERIPHERALS RCC">
            <description>NSING N32G430 Standard Peripherals driver with RCC</description>
            <require condition="N32G430 CMSIS"/>
            <require Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="RCC"/>
        </condition>
		<!-- N32G430 STDPERIPHERALS MISC Conditions -->
        <condition id="N32G430 STDPERIPHERALS MISC">
            <description>NSING N32G430 Standard Peripherals driver with MISC</description>
            <require condition="N32G430 CMSIS"/>
            <require Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="MISC"/>
        </condition>

		<!-- N32G430 STDPERIPHERALS EVAL Conditions -->
		<condition id="N32G430 STDPERIPHERALS EVAL">
			<description>NSING N32G430 Standard Peripherals Drivers with EVAL</description>
			<require condition="N32G430 CMSIS"/>
			<require Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="GPIO"/>
			<require Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="EXTI"/>
			<require Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="USART"/>
		</condition>
    </conditions>

    <components>
	    <!-- N32G430_StdPeripherals -->
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="MISC" Cversion="1.2.1"  condition="N32G430 CMSIS">
		  <description>MISC driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_MISC
			</RTE_Components_h>
			<files>
			  <!-- MISC flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/misc.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/misc.c" attr="config" version="1.2.1" />
			</files>
		</component>	
		
		<component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="ADC" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Analog-to-digital converter (ADC) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_ADC
			</RTE_Components_h>
			<files>
			  <!-- ADC flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_adc.h"/>
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_adc.c" attr="config" version="1.2.1" />
			</files>
		</component>

	   <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="BEEPER" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Backup register(Beeper) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_BEEPER
			</RTE_Components_h>
			<files>
			  <!-- BKP flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_beeper.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_beeper.c" attr="config" version="1.2.1" />
			</files>
		</component>

		<component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="CAN" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Controller Area Network (CAN) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_CAN
			</RTE_Components_h>
			<files>
			  <!-- CAN flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_can.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_can.c" attr="config" version="1.2.1" />
			</files>
		</component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="COMP" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
            <description>Comparator (COMP) driver for N32G430</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_COMP
            </RTE_Components_h>
            <files>
                <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_comp.h"/>
                <file category="source" name="Device/Firmware/Peripherals/src/n32g430_comp.c"/>
            </files>
        </component> 

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="CRC" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Cyclic Redundancy Check (CRC) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_CRC
			</RTE_Components_h>
			<files>
			  <!-- CRC flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_crc.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_crc.c" attr="config" version="1.2.1" />
			</files>
		</component>

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="DBG" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Debug (DBG) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_DBG
			</RTE_Components_h>
			<files>
			  <!-- DBG flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_dbg.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_dbg.c" attr="config" version="1.2.1" />
			</files>
		</component>

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="DMA" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Direct Memory Access (DMA) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_DMA
			</RTE_Components_h>
			<files>
			  <!-- DMA flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_dma.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_dma.c" attr="config" version="1.2.1" />
			</files>
		</component>

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="EXTI" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>External Interrupt/Event (EXTI) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_EXTI
			</RTE_Components_h>
			<files>
			  <!-- EXTI flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_exti.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_exti.c" attr="config" version="1.2.1" />
			</files>
		</component>
		
