vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G430_DFP.pdsc
        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="FLASH" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
            <description>Embedded Flash memory (FLASH) driver for N32G430</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_FLASH
            </RTE_Components_h>
            <files>
                <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_flash.h"/>
                <file category="source" name="Device/Firmware/Peripherals/src/n32g430_flash.c"/>
            </files>
        </component>		
		
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="GPIO" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>General-purpose and Alternate-function I/Os (GPIO) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_GPIO
			</RTE_Components_h>
			<files>
			  <!-- GPIO flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_gpio.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_gpio.c" attr="config" version="1.2.1" />
			</files>
		</component>		
		
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="I2C" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
		  <description>Inter-integrated Circuit (I2C) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_I2C
			</RTE_Components_h>
			<files>
			  <!-- I2C flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_i2c.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_i2c.c" attr="config" version="1.2.1" />
			</files>
		</component>		

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="IWDGT" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Free watchdog timer(IWDGT) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_IWDGT
			</RTE_Components_h>
			<files>
			  <!-- FWDGT flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_iwdg.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_iwdg.c" attr="config" version="1.2.1" />
			</files>
	    </component>

        <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="LPTIM" Cversion="1.2.1" condition="N32G430 STDPERIPHERALS RCC">
            <description>Low Power Timers (LPTIM) driver for N32G430</description>
            <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_LPTIM
            </RTE_Components_h>
            <files>
                <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_lptim.h"/>
                <file category="source" name="Device/Firmware/Peripherals/src/n32g430_lptim.c"/>
            </files>
        </component>	

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="PWR" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Power Managment Unit(PWR) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_PWR
			</RTE_Components_h>
			<files>
			  <!-- PMU flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_pwr.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_pwr.c" attr="config" version="1.2.1" />
			</files>
		</component>		
		
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="RCC" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS MISC">
		  <description>Reset and Clock Control (RCC) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_RCC
			</RTE_Components_h>
			<files>
			  <!-- RCC flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_rcc.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_rcc.c" attr="config" version="1.2.1" />
			</files>
		</component>		

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="RTC" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Real-time Clock (RTC) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_RTC
			</RTE_Components_h>
			<files>
			  <!-- RTC flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_rtc.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_rtc.c" attr="config" version="1.2.1" />
			</files>
		</component>

	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="SPI_I2S" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_SPI
			</RTE_Components_h>
			<files>
			  <!-- SPI flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_spi.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_spi.c" attr="config" version="1.2.1" />
			</files>
		</component>
		
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="TIMER" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>TIMER driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_TIMER
			</RTE_Components_h>
			<files>
			  <!-- TIMER flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_tim.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_tim.c" attr="config" version="1.2.1" />
			</files>
		</component>		
	   
  	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="USART" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_USART
			</RTE_Components_h>
			<files>
			  <!-- USART flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_usart.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_usart.c" attr="config" version="1.2.1" />
			</files>
		</component>		

