vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NSING.N32G430_DFP.pdsc
	    <component Cclass="Device" Cgroup="N32G430_StdPeripherals" Csub="WWDGT" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS RCC">
		  <description>Window Watchdog Timer (WWDGT) driver for N32G430 Devices</description>
			<RTE_Components_h>
			#define RTE_DEVICE_STDPERIPHERALS_WWDGT
			</RTE_Components_h>
			<files>
			  <!-- WWDGT flie -->
			  <file category="header" name="Device/Firmware/Peripherals/inc/n32g430_wwdg.h" />
			  <file category="source" name="Device/Firmware/Peripherals/src/n32g430_wwdg.c" attr="config" version="1.2.1" />
			</files>
		</component>		

		<!-- BSP N32G430 -->
		<component Cclass="Device" Cgroup="EVAL" Csub="N32G430" Cversion="1.2.1"  condition="N32G430 STDPERIPHERALS EVAL">
		  <description>Firmware functions to manage Leds, Keys, COM ports for N32G430 board</description>
		  <files>
			<!-- include folder -->
			<file category="header" name="Device/BSP/inc/log.h" />
			<!-- eval file -->
			<file category="source" name="Device/BSP/src/log.c" attr="config" version="1.2.1"/>
		  </files>
		</component>

	   <!-- Startup N32G430 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="1.2.1" condition="N32G430">
		  <description>System Startup for NSING N32G430 Devices</description>
		  <files>
			<!-- include folder -->
			<file category="include" name="Device/Include/"/>
			<file category="header" name="Device/Include/n32g430.h"/>
			<!-- startup file -->
			<file category="source" name="Device/Source/ARM/startup_n32g430.s" attr="config" version="1.2.1" condition="Compiler ARMCC"/>
			<!-- system file -->
			<file category="source" name="Device/Source/system_n32g430.c"  attr="config" version="1.2.1"/>
		  </files>
		</component>	       

	   <!-- Algo N32G430 -->
 <!--
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="Common" Cversion="1.2.1" condition="N32G430 CMSIS Device">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_COMMON
            </RTE_Components_h>
            <files>
                <file category="include" name="firmware/n32g430_algo_lib/inc" />
                <file category="header" name="firmware/n32g430_algo_lib/inc/n32g430_algo_common.h"/>
                <file category="source" name="firmware/n32g430_algo_lib/lib/n32g430_algo_common.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="AES" Cversion="1.2.1" condition="N32G430 Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_AES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g430_algo_lib/inc/n32g430_aes.h"/>
                <file category="source" name="firmware/n32g430_algo_lib/lib/n32g430_aes.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="DES" Cversion="1.2.1" condition="N32G430 Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_DES
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g430_algo_lib/inc/n32g430_des.h"/>
                <file category="source" name="firmware/n32g430_algo_lib/lib/n32g430_des.lib"/>
            </files>
        </component>
        <component Cclass="Device" Cgroup="Algorithm Libs" Csub="HASH" Cversion="1.2.1" condition="N32G430 Algorithm Common">
            <RTE_Components_h>
        #define RTE_DEVICE_ALGO_HASH
            </RTE_Components_h>
            <files>
                <file category="header" name="firmware/n32g430_algo_lib/inc/n32g430_hash.h"/>
                <file category="source" name="firmware/n32g430_algo_lib/lib/n32g430_hash.lib"/>
            </files>
        </component>
-->		

    </components>
</package>
